<center><u><H1>MySQL y Pandas</H1></u></center>

## Installation:
- pip install PyMySQL

In [1]:
import pymysql
import pandas as pd

## Open a Connection:

In [6]:
def connection():
    try:
        conn = pymysql.connect(host='127.0.0.1',
                               port=3306,
                               user='python',
                               password='mysql',
                               db='customers')
    finally:
        print("Conexion Exitosa")
    return conn

## Select

In [7]:
conn = connection()
    
sql = "SELECT name,sex,state,tel FROM client"
        
titles='Name sex State Tel'.split()
        
df=pd.read_sql(sql,con=conn)
        
df.columns = titles
           
conn.close()
df.head()

Conexion Exitosa

              Name sex State          Tel
0        Lucy Mall   F    CA  805-5553338
1       Carl Sagan   M    NY  800-8526680
2     Erick Mathew   M    CA  805-2151048
3      Selena Wang   F    NY  801-1152279
4  Michael Platini   M    NY  805-5251348

## JOIN:

In [10]:
conn = connection()
sql = "select name,sex,state,tel,addr as address from client join address on client.idclient = address.idcli"
titles='Name Sex State Tel Address'.split()
df=pd.read_sql(sql,con=conn)
df.columns = titles
            
conn.close()
df.head()

Conexion Exitosa

,Name,Sex,State,Tel,Address
0,Lucy Mall,F,CA,805-5553338,"10017 Santa Monica Boulevard-LA, CA 90025-4718"
1,Carl Sagan,M,NY,800-8526680,"309 W 35th St, New York, NY 10001"
2,Erick Mathew,M,CA,805-2151048,"18110 Vanowen St, Reseda, CA 91335"
3,Selena Wang,F,NY,801-1152279,"307 E 5th St, New York, NY 10003"
4,Michael Platini,M,NY,805-5251348,"1204 W 11th St, New York, NY 10001"

## Conditional Select:

In [11]:
conn = connection()
state = 'CA'
    
sql = "select name,sex,state,tel,addr as Address from client join address on client.idclient = address.idcli where state='"+ state +"'"
titles='Name Sex State Tel Address'.split()
        
df=pd.read_sql(sql,con=conn)    
df.columns = titles
df.head()

Conexion Exitosa

,Name,Sex,State,Tel,Address
0,Lucy Mall,F,CA,805-5553338,"10017 Santa Monica Boulevard-LA, CA 90025-4718"
1,Erick Mathew,M,CA,805-2151048,"18110 Vanowen St, Reseda, CA 91335"

## Reference:

https://pypi.org/project/PyMySQL/

http://pymysql.readthedocs.io/en/latest/user/examples.html